tests/load/chat.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 10
    - duration: 120
      arrivalRate: 50
    - duration: 60
      arrivalRate: 100
  defaults:
    headers:
      Content-Type: 'application/json'

scenarios:
  - name: 'Chat request'
    flow:
      - post:
          url: '/api/gemini/stream'
          json:
            model: 'gemini-3.5-flash'
            prompt: 'Hello, how are you?'